micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Inc/stm32n6xx_hal_gpio.h
#define IS_GPIO_SINGLE_PIN(__PIN__) (((__PIN__) == GPIO_PIN_0)   ||\
                                     ((__PIN__) == GPIO_PIN_1)   ||\
                                     ((__PIN__) == GPIO_PIN_2)   ||\
                                     ((__PIN__) == GPIO_PIN_3)   ||\
                                     ((__PIN__) == GPIO_PIN_4)   ||\
                                     ((__PIN__) == GPIO_PIN_5)   ||\
                                     ((__PIN__) == GPIO_PIN_6)   ||\
                                     ((__PIN__) == GPIO_PIN_7)   ||\
                                     ((__PIN__) == GPIO_PIN_8)   ||\
                                     ((__PIN__) == GPIO_PIN_9)   ||\
                                     ((__PIN__) == GPIO_PIN_10)  ||\
                                     ((__PIN__) == GPIO_PIN_11)  ||\
                                     ((__PIN__) == GPIO_PIN_12)  ||\
                                     ((__PIN__) == GPIO_PIN_13)  ||\
                                     ((__PIN__) == GPIO_PIN_14)  ||\
                                     ((__PIN__) == GPIO_PIN_15))

#define IS_GPIO_COMMON_PIN(__RESETMASK__, __SETMASK__) (((uint32_t)(__RESETMASK__) & (uint32_t)(__SETMASK__)) == 0x00u)

#define IS_GPIO_MODE(__MODE__)      (((__MODE__) == GPIO_MODE_INPUT)              ||\
                                     ((__MODE__) == GPIO_MODE_OUTPUT_PP)          ||\
                                     ((__MODE__) == GPIO_MODE_OUTPUT_OD)          ||\
                                     ((__MODE__) == GPIO_MODE_AF_PP)              ||\
                                     ((__MODE__) == GPIO_MODE_AF_OD)              ||\
                                     ((__MODE__) == GPIO_MODE_IT_RISING)          ||\
                                     ((__MODE__) == GPIO_MODE_IT_FALLING)         ||\
                                     ((__MODE__) == GPIO_MODE_IT_RISING_FALLING)  ||\
                                     ((__MODE__) == GPIO_MODE_EVT_RISING)         ||\
                                     ((__MODE__) == GPIO_MODE_EVT_FALLING)        ||\
                                     ((__MODE__) == GPIO_MODE_EVT_RISING_FALLING) ||\
                                     ((__MODE__) == GPIO_MODE_ANALOG))

#define IS_GPIO_SPEED(__SPEED__)    (((__SPEED__) == GPIO_SPEED_FREQ_LOW)       ||\
                                     ((__SPEED__) == GPIO_SPEED_FREQ_MEDIUM)    ||\
                                     ((__SPEED__) == GPIO_SPEED_FREQ_HIGH)      ||\
                                     ((__SPEED__) == GPIO_SPEED_FREQ_VERY_HIGH))

#define IS_GPIO_PULL(__PULL__)      (((__PULL__) == GPIO_NOPULL)   ||\
                                     ((__PULL__) == GPIO_PULLUP)   || \
                                     ((__PULL__) == GPIO_PULLDOWN))

#define IS_GPIO_DELAY(__DELAY__)    (((__DELAY__) == GPIO_DELAY_PS_0)      ||\
                                     ((__DELAY__) == GPIO_DELAY_PS_300)    ||\
                                     ((__DELAY__) == GPIO_DELAY_PS_500)    ||\
                                     ((__DELAY__) == GPIO_DELAY_PS_750)    ||\
                                     ((__DELAY__) == GPIO_DELAY_PS_1000)   ||\
                                     ((__DELAY__) == GPIO_DELAY_PS_1250)   ||\
                                     ((__DELAY__) == GPIO_DELAY_PS_1500)   ||\
                                     ((__DELAY__) == GPIO_DELAY_PS_1750)   ||\
                                     ((__DELAY__) == GPIO_DELAY_PS_2000)   ||\
                                     ((__DELAY__) == GPIO_DELAY_PS_2250)   ||\
                                     ((__DELAY__) == GPIO_DELAY_PS_2500)   ||\
                                     ((__DELAY__) == GPIO_DELAY_PS_2750)   ||\
                                     ((__DELAY__) == GPIO_DELAY_PS_3000)   ||\
                                     ((__DELAY__) == GPIO_DELAY_PS_3250))

#define IS_GPIO_RETIME(__RETIME__)  (((__RETIME__) == GPIO_RETIME_ON)   ||\
                                     ((__RETIME__) == GPIO_RETIME_OFF))

#define IS_GPIO_CLOCK(__CLOCK__)    (((__CLOCK__) == GPIO_CLOCK_RISING)    ||\
                                     ((__CLOCK__) == GPIO_CLOCK_FALLING)   || \
                                     ((__CLOCK__) == GPIO_CLOCK_RISING_FALLING))

#define IS_GPIO_PATH(__PATH__)      (((__PATH__) == GPIO_PATH_OUT)   ||\
                                     ((__PATH__) == GPIO_PATH_IN))

#if defined CPU_IN_SECURE_STATE
#define IS_GPIO_PIN_ATTRIBUTES(__ATTR__) (((((__ATTR__) & GPIO_PIN_SEC) == GPIO_PIN_SEC) || \
                                           (((__ATTR__) & GPIO_PIN_NSEC) == GPIO_PIN_NSEC) || \
                                           (((__ATTR__) & GPIO_PIN_PRIV) == GPIO_PIN_PRIV) || \
                                           (((__ATTR__) & GPIO_PIN_NPRIV) == GPIO_PIN_NPRIV)) && \
                                          (((__ATTR__) & ~(GPIO_PIN_SEC|GPIO_PIN_NSEC|GPIO_PIN_PRIV|GPIO_PIN_NPRIV)) == 0U))
#else
#define IS_GPIO_PIN_ATTRIBUTES(__ATTR__) (((((__ATTR__) & GPIO_PIN_PRIV) == GPIO_PIN_PRIV) || \
                                           (((__ATTR__) & GPIO_PIN_NPRIV) == GPIO_PIN_NPRIV)) && \
                                          (((__ATTR__) & ~(GPIO_PIN_PRIV | GPIO_PIN_NPRIV)) == 0U))
#endif /* CPU_IN_SECURE_STATE */
/**
  * @}
  */

/* Include GPIO HAL Extended module */
#include "stm32n6xx_hal_gpio_ex.h"

/* Exported functions --------------------------------------------------------*/
/** @defgroup GPIO_Exported_Functions GPIO Exported Functions
  *  @brief    GPIO Exported Functions
  * @{
  */

/** @defgroup GPIO_Exported_Functions_Group1 Initialization/de-initialization functions
  *  @brief    Initialization and Configuration functions
  * @{
  */

/* Initialization and de-initialization functions *****************************/
void              HAL_GPIO_Init(GPIO_TypeDef  *GPIOx, const GPIO_InitTypeDef *GPIO_Init);
void              HAL_GPIO_DeInit(GPIO_TypeDef  *GPIOx, uint32_t GPIO_Pin);

/**
  * @}
  */

/** @defgroup GPIO_Exported_Functions_Group2 IO operation functions
  *  @brief    IO operation functions
  * @{
  */

/* IO operation functions *****************************************************/
GPIO_PinState     HAL_GPIO_ReadPin(const GPIO_TypeDef *GPIOx, uint16_t GPIO_Pin);
void              HAL_GPIO_WritePin(GPIO_TypeDef *GPIOx, uint16_t GPIO_Pin, GPIO_PinState PinState);
void              HAL_GPIO_TogglePin(GPIO_TypeDef *GPIOx, uint16_t GPIO_Pin);
void              HAL_GPIO_WriteMultipleStatePin(GPIO_TypeDef *GPIOx, uint16_t PinReset, uint16_t PinSet);
HAL_StatusTypeDef HAL_GPIO_LockPin(GPIO_TypeDef *GPIOx, uint16_t GPIO_Pin);
void              HAL_GPIO_SetRetime(GPIO_TypeDef *GPIOx, uint16_t GPIO_Pin, const GPIO_RetimeTypeDef *pRet_Init);
HAL_StatusTypeDef HAL_GPIO_GetRetime(const GPIO_TypeDef *GPIOx, uint16_t GPIO_Pin, GPIO_RetimeTypeDef *pRet_Init);
void              HAL_GPIO_SetDelay(GPIO_TypeDef *GPIOx, uint16_t GPIO_Pin, const GPIO_DelayTypeDef *pDly_Init);
HAL_StatusTypeDef HAL_GPIO_GetDelay(const GPIO_TypeDef *GPIOx, uint16_t GPIO_Pin, GPIO_DelayTypeDef *pDly_Init);
void              HAL_GPIO_EXTI_IRQHandler(uint16_t GPIO_Pin);
void              HAL_GPIO_EXTI_Rising_Callback(uint16_t GPIO_Pin);
void              HAL_GPIO_EXTI_Falling_Callback(uint16_t GPIO_Pin);

/**
  * @}
  */

#if defined CPU_IN_SECURE_STATE

/** @defgroup GPIO_Exported_Functions_Group3 IO attributes management functions
  * @{
  */

/* IO attributes management functions *****************************************/
void              HAL_GPIO_LockPinAttributes(GPIO_TypeDef *GPIOx, uint16_t GPIO_Pin);
uint32_t          HAL_GPIO_GetLockPinAttributes(const GPIO_TypeDef *GPIOx);
#endif /* CPU_IN_SECURE_STATE */
void              HAL_GPIO_ConfigPinAttributes(GPIO_TypeDef *GPIOx, uint16_t GPIO_Pin, uint32_t PinAttributes);
HAL_StatusTypeDef HAL_GPIO_GetConfigPinAttributes(const GPIO_TypeDef *GPIOx, uint16_t GPIO_Pin,
                                                  uint32_t *pPinAttributes);

/**
  * @}
  */


/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* STM32N6xx_HAL_GPIO_H */

